# 1 
# 1) 1부터 10사이의 벡터를 만들어서 v1 이라는 변수에 저장한다.
# 2) 각 원소 값들에 2를 곱한 결과로 벡터 v2 를 만든다.
# 3) v2 에서 최소값을 추출하여 min_v 에 저장한다.
# 4) v2 에서 평균값을 추출하여 avg_v 에 저장한다.
# 5) v2 에서 합을 추출하여 sum_v 에 저장한다.
# 6) v2 에서 5번째 원소를 제외하고 v3 라는 변수에 저장한다.
# 7) v1, v2, v3, max_v, min_v, avg_v, sum_v를 화면에 출력한다

# 2. 
# 1) 10 에서 38사이의 숫자 중에서 2씩 증가한 값으로 벡터를 생성하고
#    3행 5열의 매트릭스를 만들어 m1 에 저장한다.(행 우선 저장)
# 2) 각 원소 값들에 +100 한 결과로 매트릭스 m2 를 만든다.
# 3) m1 에서 최대값을 추출하여 m_max_v 에 저장한다.
# 4) m1 에서 최소값을 추출하여 m_min_v 에 저장한다.
# 5) m1 에서 행 단위의 최대값을 추출하여 row_max 에 저장한다.
# 6) m1 에서 열 단위의 최대값을 추출하여 col_max 에 저장한다.
# 7) m1, m2, m_max_v, m_min_v, row_max, col_max를 화면에 출력한다.


# 3.
# 1) seq() 또는 rep() 함수를 이용하여 다음 결과가 나오도록 명령을 작성한다.
# 2) 1, 3, 5, 7, 9
# 3) 1, 1, 1, 1, 1
# 4) 1, 2, 3, 1, 2, 3, 1, 2, 3
# 5) 1, 1, 2, 2, 3, 3, 4, 4

# 4. 1부터 10 까지 출력하는데 3씩 증가 되는 형태로(1 4 7 10)
#    저장되는 벡터를 정의하여  v3 변수에 저장한다.

# 5. 
# 1) 1부터 100으로 구성되는 7개의 중복되지 않는 데이터를 추출하여 
#    count 라는 백터를 만든다. 
# 2) 추출된 값이 – 21, 40, 11, 55, 70, 90, 30 이라면 다음과 같이 출력한다.
#    일요일 : 21   월요일 : 40   화요일 : 11 ……………..   토요일 : 30
# 3) 값이 가장 큰 요일명을 출력한다.
# 4) 값이 가장 작은 요일명을 출력한다(which.max이용)
# 5) 값이 가장 작은 요일명을 출력한다(which.min이용)
# 6) 50보다 큰 값의 요일명을 출력한다.

# 6. 다음과 같이 값이 구성되는 매트릭스를 정의하여 m1 에 저장한다.
# 1,2,3 의 벡터 n1, 4,5,6 의 벡터 n2, 7,8,9 의 벡터 n3 를 이용하여 matrix를 생성한다.

# 7. 다음과 같이 값이 구성되는 매트릭스를 정의하여 m2 에 저장한다.
#    1~9 의 벡터를 이용하여 matrix를 생성한다.

# 8. m2 를 가지고 다음과 같이 값이 구성되는 매트릭스를 정의하여 m3 에 저장한다.

# 9. 다음과 같이 구성 되는 2행 3열 매트릭스 alpha를 생성한다.

# 10. 다음과 같이 값이 구성되는 배열을 정의하여 a 라는 변수에 저장한다.
# 1) 2행 3열 4층
# 2) 각 층의 2행
# 3) 각 층의 1열 
# 4) 3층의 모든 데이터
# 5) a라는 배열을 구성하는 모든 데이터에 +100을 연산하여 출력한다.
# 6) 4층의 모든 데이터들에 100을 곱한 결과를 출력한다.
# 7) 각 층의 1행, 2열과 3열
# 8) 2층의 2행 데이터들의 값을 100을 더한 값으로 변경한다.
# 9) 1층의 모든 데이터들의 값에 2를 뺀 값으로 변경한다.
# 10) a 배열의 모든 데이터 값들을 10을 곱한 값으로 변경한다.
# 11) a 변수 삭제 

# 11. 다음과 같이 값이 구성되는 데이터프레임을 정의하여 df1 에 저장한다.

# 12. 다음과 같이 값이 구성되는 데이터프레임을 정의하여 df2 에 저장한다.

# 13. c()함수로 먼저 벡터를 생성한 다음 data.frame() 사용

# 14. 앞에서 만든 데이터 프레임을 이용해서 
#     과일 가격 평균, 판매량 평균을 구해본다.

# 15. 다음 세 벡터를 이용하여 데이터프레임을 생성하고, 
#     name 변수는 문자, gender 변수는 팩터, 
#     math 변수는 숫자 데이터의 유형이라는 것을 확인하시오.
# 1)  stat 변수를 추가하시오. stat <- c(76, 73, 95, 82, 35)
# 2) math 변수와 stat 변수의 합을 구하여 score 변수에 저장하시오. 
# 3) 논리 연산 인덱싱을 이용하여 score가 150 이상이면 A, 
#    100 이상 150 미만이면 B, 70 이상 100 미만이면 
#    C 등급을 부여하고 grade 변수에 저장하시오.	

# 16. 다음과 같이 값이 구성되는 리스트를 정의하여 L1 에 저장한다.
#     그리고 3000 을 추출하여 2를 곱한 후에 result1  변수에 저장한다.

# 17. 다음과 같이 값이 구성되는 리스트를 정의하여 L2 에 저장한다.

# 18. 다음 리스트에서 A를 "Alpha"로 대체한다.
#     list(c(3,5,7), c("A", "B", "C"))

# 19. 다음 리스트에서 첫 번째 원소(alpha)의 각 값에 10을 더하여 출력한다.
#     list(alpha=0:4, beta=sqrt(1:5), gamma=log(1:5))
#     sqrt(1); 루트1 log(1); log 1 (base엔 지수e) 

# 20. 다음 리스트는 math, writing, reading의 중간고사 및 기말고사 점수이다. 
#     전체 평균을 계산한다.
#     (힌트 : unlist() 함수를 활용한다. unlist() : 리스트를 벡터형식의 데이터셋으로 풀어주는 함수)
#     list(math=list(95, 90), writing=list(90, 85), reading=list(85, 80))

# 21. iris 데이터에서 다름 기본 정보를 조회한다(기본정보조회)
# 1) 타입
# 2) 구조
# 3) 차원 
# 4) 변수이름
# 5) 기본통계량(평균, 표준편차, 사분위수)

# 22. iris 데이터 정렬하기 
# 1) Petal.Length를 기준으로 내림차순으로 정렬하세요(iris전체 출력)
# 2) Sepal.Width 를 내림차순 정렬하세요(Sepal.Width만 출력)

# 23. iris 데이터의 종별 데이터 갯수

# 24. 종별 Sepal.Length의 합을 출력한다.

# 25. Sepal.Length, Sepal.Width, Petal.Length, Petal.Width의 평균을 출력

# 26. 꽃받침의 길이(Sepal.Length)가  가장 긴 꽃의 종은?





