# datasets::cars데이터 셋 분석하기 

# 1. 속도에 대한 제동거리의 산점도와 적합도(신뢰구간 그래프)를 나타내시오
#    (단, 속도가 5부터 20까지 제동거리 0부터 100까지만 그래프에 나타냄)
?cars

# 2. 1인당국내총생산에 대한 기대수명의 산점도를 대륙별 다른 색으로 나타내시오.

# 3.기대 수명이 70을 초과하는 데이터에 대해 대륙별 데이터 갯수

# 4. 기대수명이 70을 초과하는 데이터에 대해 대륙별 나라 수

# 5. 대륙별 기대수명의 사분위수 시각화

# 6. 년도별 gdp와 기대수명과의 관계를 산점도를 그리고 
#    대륙별 점의 색상을 달리 시각화


# 7. 북한과 한국의 년도별 GDP 변화를 산점도로 시각화하시오
# (북한:Korea, Dem. Rep.  한국:Korea, Rep.  
#  substr(str, start, end)함수 이용)

# 8. 한중일 4개국별 GDP 변화를 산점도와 추세선으로 시각화 하시오.

# 9. 한중일 4개국별 인구변화를 산점도와 추세선으로 시각화 하시오
#    (scale_y_continuous(labels = scales::comma)추가시 우측처럼)

# 10. ggplot2::economic 데이터 셋의 개인 저축률(psavert)이 
#     시간에 따라 어떻게 변해 왔는지 알아보려 한다. 
#     시간에 따른 개인 저축률의 변화를 나타낸 
#     시계열 그래프와 추세선을 시각화하시오


# 11. x=date, y=psavert 시계열그래프+추세선(적합도선) 
#     x=date, y=unemploy



